kOmegaSST/PlasmaRegionOn/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 6;  // Number of subdomains (4 processors)

method          simple;  // Simple method for decomposition

simpleCoeffs
{
    n               (3 2 1);  // The number of divisions in the x, y, and z directions (2 x 1 x 2)
}



// ************************************************************************* //
