kOmegaSST/PlasmaRegionOn/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|pFinal)" 
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0.01;
    }

    Phi
    {
        $p;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0.01;
        nSweeps         1;
    }

    UFinal
    {
	$U;
	relTol		0;
    }

    k
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-5;
        relTol          0.01;
        nSweeps         1;
    }

    "(omega|gammaInt|ReThetat)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-5;
        relTol          0.01;
        nSweeps         1;
    }

    "(k|omega|gammaInt|ReThetat)Final"
    {
	$k;
	relTol		0;
	$omega;
	relTol		0;
    }
}

PIMPLE
{
    nOuterCorrectors	1;//maybe 2
    nCorrectors		2;// maybe 1
    correctPhi yes;
    nNonOrthogonalCorrectors 2;
    pRefCell 0;
    pRefValue 0;

}

potentialFlow
{
    nNonOrthogonalCorrectors 3;
}

relaxationFactors
{
    equations
    {
	"(U|k|omega|gammaInt|ReThetat)"	0.7;
	"(U|k|omega|gammaInt|ReThetat)Final" 1.0;
        //U               0.5;
        //k               0.7;
        //omega           0.7;
	//UFinal	  0.5;
    }
}

cache
{
    grad(U);
}

fvOptions
{
    actuatorForceSource;
}

// ************************************************************************* //
